ZiGaMi/nRF5_nRF52840_DevBoard/src/drivers/peripheral/ble/ble_p.c
#ifndef DEBUG
    #undef BLE_P_DEBUG_EN
    #define BLE_P_DEBUG_EN 0
#endif

/**
 *  Enable/Disable assertion
 *
 *  @note   Disble in release!
 */
 #define BLE_P_ASSERT_EN                    ( 1 )

#ifndef DEBUG
    #undef PAR_CFG_ASSERT_EN
    #define PAR_CFG_ASSERT_EN 0
#endif

/**
 * 	Debug communication port macros
 */
#if ( 1 == BLE_P_DEBUG_EN )
	#define BLE_P_DBG_PRINT( ... )			( cli_printf( __VA_ARGS__ ))
#else
	#define BLE_P_DBG_PRINT( ... )			{ ; }

#endif

/**
 *  Assertion definition
 */
 #if ( BLE_P_ASSERT_EN )
	#define BLE_P_ASSERT(x)                 { PROJECT_CONFIG_ASSERT(x) }
 #else
  #define BLE_P_ASSERT)                     { ; }
 #endif

/**
 *  Invalid configuration catcher
 */

 // Min. connection interval must be smaller than max.
 _Static_assert( BLE_P_MIN_CONN_INTERVAL_MS < BLE_P_MAX_CONN_INTERVAL_MS );

// Slave lateny must be in valid range
_Static_assert(( BLE_P_SLAVE_LATENCY >= 0) && ( BLE_P_SLAVE_LATENCY < 500 ));

// Supervision timeout must be in valid range
_Static_assert(( BLE_P_SUPERVISION_TIMEOUT_MS >= 100) && ( BLE_P_SUPERVISION_TIMEOUT_MS <= 32000 ));

// Supervision timeout additional condition must be meet
_Static_assert( BLE_P_SUPERVISION_TIMEOUT_MS > (( 1 + BLE_P_SLAVE_LATENCY ) * 2 * BLE_P_MAX_CONN_INTERVAL_MS ));

// Advertisement interval must be in valid range
_Static_assert(( BLE_P_ADV_INTERVAL_MS >= 20) && ( BLE_P_ADV_INTERVAL_MS <= 10240 ));









/**
 *      BLE Event priority
 */
#define BLE_EVENT_PRIORITY              3 

/**
 *      BLE connection tag
 */ 
#define BLE_CONN_CFG_TAG                ( 1 )





/******************************************************************
 *      ADVERTISEMENT
 ******************************************************************/

 /**
  *     Advertisement inteval
  * 
  * @note   In units of 0.625 ms. E.g. value of 300 corresponds to 187.5 ms.
  *
  * @note   Place time in ms as it will be re-calculated later into proper values!
  *
  *     Unit: ms
  */
#define GAP_ADV_INTERVAL_MS                 ( 200.0 )

/**
 *      Advertisement duration
 *
 * @note    In units of 10 milliseconds. Anyway place time in ms as it 
 *          will be re-calculated later into proper values!
 *
 * @note    Set to 0 if wanted continous advertisement!  
 *   
 *  Unit: ms
 */
#define GAP_ADV_DURATION_MS                 ( 0 )


/******************************************************************
 *      CONNECTIONS
 ******************************************************************/

#define FIRST_CONN_PARAMS_UPDATE_DELAY      APP_TIMER_TICKS(5000)                   /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (5 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY       APP_TIMER_TICKS(30000)                  /**< Time between each call to sd_ble_gap_conn_param_update after the first call (30 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT        3                                       /**< Number of attempts before giving up the connection parameter negotiation. */





////////////////////////////////////////////////////////////////////////////////
// Variables
////////////////////////////////////////////////////////////////////////////////

/**
 *      Initialization guards
 */
static bool gb_is_init = false;

/**
 *      Reception buffer space
 */
static uint8_t gu8_ble_rx_buffer[BLE_P_RX_BUF_SIZE] = {0};

/**
 *      UART Rx buffer
 */
static p_ring_buffer_t 		g_rx_buf = NULL;
const ring_buffer_attr_t 	g_rx_buf_attr = 
{ 	
    .name 		= "BLE P Rx Buf",
    .item_size 	= sizeof(uint8_t),
    .override 	= false,
    .p_mem 		= &gu8_ble_rx_buffer 
};

/**
 *      BLE Peripheral data
 */
static ble_p_data_t g_ble_p = 
{ 
    .conn_handle = BLE_CONN_HANDLE_INVALID,

};
    
/**
 *  GATT instance
 */
NRF_BLE_GATT_DEF( m_gatt );








// For single connected device
NRF_BLE_QWR_DEF( m_qwr );




// Advertising instance
BLE_ADVERTISING_DEF( m_advertising );


// TODO: Check if can be omited!
//static uint16_t m_conn_handle = BLE_CONN_HANDLE_INVALID;


#define ADV_DATA_SIZE       ( 15 )
static uint8_t my_adv_data[ADV_DATA_SIZE] = { 0 };


// Available services as it will be part of advertisement packet
static ble_uuid_t m_adv_uuids[] = 
{ 
    {   .uuid = BLE_UUID_HEALTH_THERMOMETER_SERVICE,    .type = BLE_UUID_TYPE_BLE  },   // SIG standard service
    {   .uuid = BLE_UUID_BATTERY_SERVICE,               .type = BLE_UUID_TYPE_BLE  },   // SIG standard service
};



static ble_gatts_char_handles_t    char_handles    = {0};

#define THERMOSTAT_SERVICE_BASE                                                \
  {                                                                            \
    0x2A, 0x94, 0x01, 0x0a, 0x34, 0xc4, 0x3e, 0xbc, 0xe5, 0x4b, 0xb3, 0x8b,    \
        0x00, 0x00, 0x9d, 0xaf                                                 \
  }

#define THERMOSTAT_SERVICE_UUID   0x1000


#define BLE_THERMOSTAT_RX_CHARACTERISTIC   0x1001
#define BLE_THERMOSTAT_TX_CHARACTERISTIC   0x1002

static ble_gatts_char_handles_t    rx_char_handles    = {0};
static ble_gatts_char_handles_t    tx_char_handles    = {0};




////////////////////////////////////////////////////////////////////////////////
// Function prototypes
////////////////////////////////////////////////////////////////////////////////
static ble_p_status_t   ble_p_stack_init        (void);
static void             ble_p_evt_hndl          (ble_evt_t const * p_ble_evt, void * p_context);
static ble_p_status_t   ble_p_gap_init          (void);
static ble_p_status_t   ble_p_gatt_init         (void);
static void             ble_p_adv_evt_hndl      (ble_adv_evt_t ble_adv_evt);
static ble_p_status_t   ble_p_adv_init          (void);



////////////////////////////////////////////////////////////////////////////////
// Functions
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
/**
*		Initialize BLE peripheral stack
*
* @return 		status - Status of initialization
*/
////////////////////////////////////////////////////////////////////////////////
static ble_p_status_t ble_p_stack_init(void)
{
    ble_p_status_t  status      = eBLE_P_OK;
    uint32_t        ram_start   = 0;  // Application RAM start address

    // Start SoftDevice
    if ( NRF_SUCCESS != nrf_sdh_enable_request())
    {
        status = eBLE_P_ERROR;
        
        BLE_P_DBG_PRINT( "BLE_P: SoftDevice enable request error!" );
    }

    // Configure BLE stack
    if ( NRF_SUCCESS != nrf_sdh_ble_default_cfg_set( BLE_CONN_CFG_TAG, &ram_start ))
    {
        status = eBLE_P_ERROR;
        
        BLE_P_DBG_PRINT( "BLE_P: SoftDevice default config set error!" );
    }

