ZiGaMi/nRF5_nRF52840_DevBoard/src/drivers/peripheral/ble/ble_p.c
    // Enable BLE stack
    if ( NRF_SUCCESS != nrf_sdh_ble_enable( &ram_start ))
    {
        status = eBLE_P_ERROR;
        
        BLE_P_DBG_PRINT( "BLE_P: SoftDevice enable error!" );
    }
    
    // Register BLE event callback
    // An observer is essentially a piece of code that listens for events.
    NRF_SDH_BLE_OBSERVER( m_ble_observer, BLE_EVENT_PRIORITY, ble_p_evt_hndl, NULL );

    return status;
}

////////////////////////////////////////////////////////////////////////////////
/**
*		Main BLE event handler
*
* @param[in] 	p_ble_evt   - Pointer to BLE event informations
* @param[in] 	p_context   - Pointer to context
* @return 		void
*/
////////////////////////////////////////////////////////////////////////////////
static void ble_p_evt_hndl(ble_evt_t const * p_ble_evt, void * p_context)
{
    // Handle BLE events
    switch( p_ble_evt->header.evt_id )
    {
        /**
         *      Disconnected from peer event
         */
        case BLE_GAP_EVT_DISCONNECTED:

            // Connection lost
            g_ble_p.conn_handle = BLE_CONN_HANDLE_INVALID;
        
            // Raise callback
            ble_p_evt_cb( eBLE_P_EVT_DISCONNECT );

            break;

        /**
         *      Connected to peer event
         */
        case BLE_GAP_EVT_CONNECTED:

            // Assing connection info to handle
            g_ble_p.conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
            
            // Assign a connection handle to a given instance of the Queued Writes module
            if ( NRF_SUCCESS != nrf_ble_qwr_conn_handle_assign( &m_qwr, g_ble_p.conn_handle ))
            {
                // TODO: How to handle this error???

                BLE_P_DBG_PRINT( "BLE_P: Assign a connection handle to QWR error!" );
                BLE_P_ASSERT( 0 );
            }

            // Raise callback
            ble_p_evt_cb( eBLE_P_EVT_CONNECT );

            break;

        /**
         *      PHY Update Procedure is complete
         *
         * @note    This event must be handler in order not to lose connection 
         *          with peer. If this event is not handled the connection
         *          will timeout.
         *
         *          Further details: https://infocenter.nordicsemi.com/index.jsp?topic=%2Fcom.nordic.infocenter.s132.api.v7.2.0%2Fgroup___b_l_e___g_a_p___p_e_r_i_p_h_e_r_a_l___p_h_y___u_p_d_a_t_e.html&cp=4_7_3_1_2_1_5_7_1
         */
        case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
            
            // Set to auto option for PHY
            const ble_gap_phys_t phys = 
            {
                .rx_phys = BLE_GAP_PHY_AUTO,
                .tx_phys = BLE_GAP_PHY_AUTO,
            };

            // Update PHY
            if ( NRF_SUCCESS != sd_ble_gap_phy_update( p_ble_evt->evt.gap_evt.conn_handle, &phys))
            {
                // TODO: How to handle this error???

                BLE_P_DBG_PRINT( "BLE_P: PHY update error!" );
                BLE_P_ASSERT( 0 );
            }

            break;

        /**
         *      A persistent system attribute access is pending
         *
         * @note    This event is triggered if the peer request a read on any of the
         *          system attributes
         *
         *          In the case where you send indications or notifications before the peer requests 
         *          such a read, for instance you want to perform a "sd_ble_gatts_service_changed()", 
         *          you need to do "the sd_ble_gatts_sys_attr_set()" first.
         *
         *          Furhter details: https://devzone.nordicsemi.com/f/nordic-q-a/54039/why-don-t-i-get-a-ble_gatts_evt_sys_attr_missing-event
         */
        case BLE_GATTS_EVT_SYS_ATTR_MISSING:

            // Update persistent system attribute information
            if ( NRF_SUCCESS != sd_ble_gatts_sys_attr_set( g_ble_p.conn_handle, NULL, 0, 0))
            {
                // TODO: How to handle this error???

                BLE_P_DBG_PRINT( "BLE_P: Setting SYSTEM_ATTRIBUTES error!" );
                BLE_P_ASSERT( 0 );
            }

            break;

        /**
         *      Write operation performed
         */
        case BLE_GATTS_EVT_WRITE:

            // Client write to RX characteristics?
            if ( p_ble_evt->evt.gatts_evt.params.write.handle == rx_char_handles.value_handle )
            {
                // Get data and lenght
                const uint8_t * p_data  = p_ble_evt->evt.gatts_evt.params.write.data;
                const uint16_t len      = p_ble_evt->evt.gatts_evt.params.write.len;

                // Debug message
                BLE_P_DBG_PRINT( "BLE_P: Rx event! (len: %d)", len );

                // Add to RX fifo
                for (uint16_t idx = 0; idx < len; idx++)
                {
                    if ( eRING_BUFFER_OK != ring_buffer_add( g_rx_buf, (uint8_t*) &p_data[idx] ))
                    {
                        // Buffer overflow!
                        BLE_P_DBG_PRINT( "BLE_P: Rx buffer overflow! Increse buffer size via \"BLE_P_RX_BUF_SIZE\" macro!");
                        
                        break;
                    }
                }

                // Raise callback
                ble_p_evt_cb( eBLE_P_EVT_RX_DATA );
            }

        break;

        default:
            // No actions...
            break;
    }
}

////////////////////////////////////////////////////////////////////////////////
/**
*		Initialize BLE Peripheral GAP
*
* @return 		status - Status of operation
*/
////////////////////////////////////////////////////////////////////////////////
static ble_p_status_t ble_p_gap_init(void)
{
    ble_p_status_t              status          = eBLE_P_OK;
    ble_gap_conn_params_t       gap_conn_params = {0};
    ble_gap_conn_sec_mode_t     security_mode   = {0};

    // Use no security
    BLE_GAP_CONN_SEC_MODE_SET_OPEN( &security_mode );

    // Set the device name
    if ( NRF_SUCCESS != sd_ble_gap_device_name_set( &security_mode, (const uint8_t*) BLE_P_DEVICE_NAME, strlen( BLE_P_DEVICE_NAME )))
    {
        status = eBLE_P_ERROR;

