ZiGaMi/nRF5_nRF52840_DevBoard/src/drivers/peripheral/ble/ble_p.c
        BLE_P_DBG_PRINT( "BLE_P: Setting device name error (GAP)!" );
    }

    // Set the apperance
    if ( NRF_SUCCESS != sd_ble_gap_appearance_set( BLE_P_DEVICE_APPEARANCE ))  
    {
        status = eBLE_P_ERROR;

        BLE_P_DBG_PRINT( "BLE_P: Setting device appearance error (GAP)!" );
    }

    // Set up GAP
    gap_conn_params.min_conn_interval   = MSEC_TO_UNITS( BLE_P_MIN_CONN_INTERVAL_MS, UNIT_1_25_MS );
    gap_conn_params.max_conn_interval   = MSEC_TO_UNITS( BLE_P_MAX_CONN_INTERVAL_MS, UNIT_1_25_MS );
    gap_conn_params.slave_latency       = BLE_P_SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout    = MSEC_TO_UNITS( BLE_P_SUPERVISION_TIMEOUT_MS, UNIT_10_MS );

    // Set the PPCP - Peripheral Prefered Connection Parameters
    if ( NRF_SUCCESS != sd_ble_gap_ppcp_set( &gap_conn_params ))
    {
        status = eBLE_P_ERROR;

        BLE_P_DBG_PRINT( "BLE_P: Setting Peripheral Prefered Connection Parameters (PPCP) error (GAP)!" ); 
    }

    return status;
}

////////////////////////////////////////////////////////////////////////////////
/**
*		Initialize BLE Peripheral GATT
*
* @return 		status - Status of operation
*/
////////////////////////////////////////////////////////////////////////////////
static ble_p_status_t ble_p_gatt_init(void)
{
    ble_p_status_t status = eBLE_P_OK;

    // Initialize GATT
    if ( NRF_SUCCESS != nrf_ble_gatt_init( &m_gatt, NULL ))
    { 
        status = eBLE_P_ERROR;

        BLE_P_DBG_PRINT( "BLE_P: GATT init error!" );  
    }

    return status;
}

////////////////////////////////////////////////////////////////////////////////
/**
*		Initialize BLE Peripheral advertisement
*
* @return 		status - Status of operation
*/
////////////////////////////////////////////////////////////////////////////////
static ble_p_status_t ble_p_adv_init(void)
{
    ble_p_status_t              status   = eBLE_P_OK;
    ble_advertising_init_t      adv_init = {0};
    ble_advdata_manuf_data_t    man_data = {0};

    // Set up advertising parameters
    adv_init.advdata.name_type              = BLE_ADVDATA_FULL_NAME;
    adv_init.advdata.include_appearance     = true;
    adv_init.advdata.flags                  = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
    adv_init.config.ble_adv_fast_enabled    = true;
    adv_init.config.ble_adv_fast_interval   = (uint32_t) ( BLE_P_ADV_INTERVAL_MS / 0.625f );
    adv_init.config.ble_adv_fast_timeout    = (uint32_t) ( BLE_P_ADV_DURATION_MS / 10.0f );
    adv_init.evt_handler                    = ble_p_adv_evt_hndl;
    adv_init.advdata.p_manuf_specific_data  = &man_data;
    
    // TODO: Find out how to add here custom service UUID
    #if 0
        // Show also available services in advertisement packet
        adv_init.advdata.uuids_complete.p_uuids = (ble_uuid_t*) &m_adv_uuids;
        adv_init.advdata.uuids_complete.uuid_cnt = 2;
    #endif

    // Set up manufacturer data
    man_data.company_identifier = BLE_P_ADV_MAN_DATA_COMPANY_ID;
    man_data.data.p_data        = "Vendor Data";
    man_data.data.size          = strlen( man_data.data.p_data );

    // Init advertisement
    if ( NRF_SUCCESS != ble_advertising_init( &m_advertising, &adv_init ))
    {
        // TODO: Change error status...
        BLE_P_DBG_PRINT( "BLE_P: SoftDevice enable error!" );
    }
    
    // Setup advertising config tag
    ble_advertising_conn_cfg_tag_set( &m_advertising, BLE_CONN_CFG_TAG );

    return status;
}

////////////////////////////////////////////////////////////////////////////////
/**
*		BLE Peripheral Advertisement event handler
*
* @param[in]    ble_adv_evt     - Advertisement event
* @return 		void
*/
////////////////////////////////////////////////////////////////////////////////
static void ble_p_adv_evt_hndl(ble_adv_evt_t ble_adv_evt)
{
    // Based on advertisemnt event
    switch (ble_adv_evt)
    {
        /**
         *      Fast advertising mode has started
         */
        case BLE_ADV_EVT_FAST:

            // Raise callback
            ble_p_evt_cb( eBLE_P_EVT_ADV_START );

            break;
        
        /**
         *      Idle; no connectable advertising is ongoing
         */
        case BLE_ADV_EVT_IDLE:

            // Raise callback
            ble_p_evt_cb( eBLE_P_EVT_ADV_END );

            break;

        default:
            // No actions...
            break;
    }
}




static void advertisement_start(void)
{
    if ( NRF_SUCCESS != ble_advertising_start( &m_advertising, BLE_ADV_MODE_FAST ))
    {
        // TODO: Change error status...
        BLE_P_DBG_PRINT( "BLE_P: SoftDevice enable error!" ); 
    }
}



static void nrf_qwr_error_hndl(uint32_t nrf_error)
{
    // Handler errors here...

}

// Init services
static ret_code_t services_init(void)
{
    ret_code_t          status      = NRF_SUCCESS;
    nrf_ble_qwr_init_t  qwr_init    = { 0 };

    // Register error hander
    qwr_init.error_handler = nrf_qwr_error_hndl;

    // Init QWR
    if ( NRF_SUCCESS != nrf_ble_qwr_init( &m_qwr, &qwr_init ))
    {
        // TODO: Change error status...
        BLE_P_DBG_PRINT( "BLE_P: SoftDevice enable error!" ); 
    }

    return status;
}


/**@brief Function for handling the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module which
 *          are passed to the application.
 *
 * @note    All this function does is to disconnect. This could have been done by simply
 *          setting the disconnect_on_fail config parameter, but instead we use the event
 *          handler mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    ret_code_t err_code;

    
    if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
    {
        err_code = sd_ble_gap_disconnect( g_ble_p.conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE );
        
        // TODO: 
        //APP_ERROR_CHECK(err_code);
    }
}


/**@brief Function for handling a Connection Parameters error.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
    // TODO: 
   // APP_ERROR_HANDLER(nrf_error);
}


// Init connection parameters
static ret_code_t conn_pars_init(void)
{
    ret_code_t              status  = NRF_SUCCESS;
    ble_conn_params_init_t  cp_init = {0};


    cp_init.p_conn_params                  = NULL;
    cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
    cp_init.disconnect_on_fail             = false;
    cp_init.evt_handler                    = on_conn_params_evt;
    cp_init.error_handler                  = conn_params_error_handler;

    if ( NRF_SUCCESS != ble_conn_params_init( &cp_init ))
    {
        // TODO: Change error status...
        BLE_P_DBG_PRINT( "BLE_P: SoftDevice enable error!" ); 
    }

